const Oferta = () => {
  return (
    <>
      <div className="flex flex-col gap-7 mt-7 mb-3">
        {/* Ссылка "Вернуться" */}
        <p className="font-normal text-[15px] leading-[87%] text-[#14229e] cursor-pointer hover:underline">
          Вернуться
        </p>

        {/* Контейнер для контактной информации */}
        <div className="flex flex-col gap-4 mb-4">
          <h2
            className="font-bold text-[14px] leading-[120%] text-[#212529]"
            style={{ fontFamily: "var(--font3)" }}
          >
            Публичная оферта
          </h2>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              1 ОБЩИЕ ПОЛОЖЕНИЯ И ОСНОВНЫЕ ТЕРМИНЫ
            </h3>
            <p className="font-medium text-[13px] leading-[154%] text-black">
              1.1. Продавец ИП Асланян Давид Арменович (ИНН 250822605454) 1.2.
              Интернет-магазин по адресу: https://don-vip.com. С его помощью
              продавец ведёт торговлю, на сайте представлены виртуальные товары,
              которые продавец предлагает покупателям, условия приобретения и
              оплаты товаров. Интернет-сайт доступен круглосуточно. Рабочие часы
              магазина (обработка и выполнение заказов) ежедневно с 09.00 до
              21.00 по московскому времени. 1.3. Покупатель - любое физическое
              лицо, которое оформило заказ на приобретение виртуального товара у
              продавца, в порядке, установленном в разделе 3 настоящей оферты.
              1.4. Оферта - публичное предложение продавца любому лицу заключить
              на её условиях договор купли - продажи виртуального товара (далее
              Договор). Оферта является публичной (п.2 ст 437 ГК РФ). Оферта
              вступает в силу с момента ее размещения на сайте интернет–магазина
              по адресу: https://don-vip.com и действует до ее отзыва. Продавец
              вправе изменить или отозвать оферту в одностороннем порядке. Все
              изменения вступают в силу и считаются доведенными до сведения
              покупателя в момент размещения на указанной интернет-странице.
              Заказы, которые уже оформлены к моменту изменения или отзыва
              оферты, исполняются на условиях оферты, которая действовала на
              момент их оформления.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              2 ПРЕДМЕТ ДОГОВОРА
            </h3>
            <p className="font-normal text-black">
              2.1. Продавец обязуется передать в собственность покупателю, а
              покупатель обязуется оплатить и принять виртуальный товар,
              заказанный на условиях оферты в интернет-магазине.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              3 ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА, ОФОРМЛЕНИЕ ЗАКАЗА
            </h3>
            <p className="font-normal text-black">
              3.1. Акцептом оферты признается момент, когда покупатель оформил
              заказ виртуального товара у продавца. С этого момента договор
              считается заключенным. 3.2. Покупатель может сделать заказ по
              телефону интернет-магазина в его рабочие часы или самостоятельно
              на сайте через форму заказа. 3.3. При оформлении заказа,
              покупатель сообщает своё имя, адрес электронной почты и контактный
              телефон. 3.4. Заказ считается оформленным в момент оплаты товара.
              3.5. Оформляя заказ, Покупатель подтверждает, что: ✔ является
              дееспособным гражданином ✔ ознакомлен с действующей редакцией
              оферты и согласен с её условиями ✔ принимает на себя обязательства
              оплатить товар и принять его ✔ передает продавцу для обработки в
              целях заключения и исполнения договора свои персональные данные:
              имя, номер телефона, адрес электронной почты ✔ дает согласие на
              обработку персональных данных в целях направления ему сообщений
              рекламного характера о товаре, проведении розыгрышей призов среди
              покупателей. Покупатель вправе отозвать согласие, уведомив
              продавца письменно по адресу его электронной почты ✔ дает
              предварительное согласие на получение рекламно-информационных
              сообщений. Покупатель вправе отозвать согласие, уведомив продавца
              письменно по адресу его электронной почты.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              4 СТОИМОСТЬ ЗАКАЗА И ЕГО ОПЛАТА
            </h3>
            <p className="font-normal text-black">
              4.1. Цену товара определяет продавец в одностороннем порядке. 4.2.
              Цена товара указана на сайте интернет-магазина 4.3. Покупатель
              может оплатить товар только в безналичной форме. Обязанность
              покупателя оплатить товар считается исполненной в момент
              поступления полной суммы оплаты на расчетный счет продавца. 4.4.
              Продавец выдает покупателю кассовый чек, подтверждающий оплату
              товара. 4.5. Право собственности на виртуальный товар переходит в
              момент полной оплаты товара.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              5 ИЗМЕНЕНИЕ ЗАКАЗА
            </h3>
            <p className="font-normal text-black">
              5.1. По согласованию с продавцом покупатель вправе изменить заказ.
              Если товар оплачен, то продавец корректирует его стоимость и
              сообщает покупателю сумму, которую необходимо доплатить.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              6 ПРОЧИЕ ПОЛОЖЕНИЯ
            </h3>
            <p className="font-normal text-black">
              6.1. Всё, что не урегулировано офертой, определяется в
              соответствии с законодательством РФ. 6.2. Реквизиты продавца: ИП:
              Асланян ИНН: 250822605454 ОГРИП: 324253600050587 Email:
              hoyakap@gmail.com Банковские реквизиты: Расчетный счет
              40802810100006388483 Банк: АО «ТБанк» БИК банка: 044525974
              Корреспондентский счет банка: 30101810145250000974
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Oferta;
