const Confidentiality = () => {
  return (
    <>
      <div className="flex flex-col gap-7 mt-7 mb-3">
        {/* Ссылка "Вернуться" */}
        <p className="font-normal text-[15px] leading-[87%] text-[#14229e] cursor-pointer hover:underline">
          Вернуться
        </p>

        {/* Контейнер для контактной информации */}
        <div className="flex flex-col gap-4 mb-4">
          <h2
            className="font-bold text-[14px] leading-[120%] text-[#212529]"
            style={{ fontFamily: "var(--font3)" }}
          >
            Политика конфиденциальности
          </h2>

          <div>
            <p className="mb-6">
              Настоящее соглашение о конфиденциальности использования
              персональных данных (далее — Соглашение о конфиденциальности)
              регулирует порядок сбора, использования и разглашения
              Администрацией сайта https://don-vip.com (Агент) информации о
              Пользователе (Принципал), которая может быть признана
              конфиденциальной или является таковой в соответствии с
              законодательством РФ Термины, используемые в настоящем Соглашении
              о конфиденциальности, если не указано иное, применяются на
              условиях и в значении, определённом Агентским договором. Факт
              использования Пользователем сайта, а также заключение Агентского
              договора являются полным и безоговорочным акцептом настоящего
              Соглашения. Незнание указанных соглашений не освобождает
              Пользователя от ответственности за несоблюдение их условий. Если
              Пользователь не согласен с условиями настоящего Соглашения или не
              имеет права на заключение Соглашения, Пользователю следует
              незамедлительно прекратить любое использование сайта.
            </p>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              1 ИСТОЧНИКИ ИНФОРМАЦИИ
            </h3>
            <p className="font-medium text-[13px] leading-[154%] text-black">
              1.1 Информация, о которой идёт речь в настоящем соглашении, может
              быть персонифицированной (прямо относящейся к конкретному лицу или
              ассоциируемой с ним) и не персонифицированной (данные о
              Пользователе сайта, полученные без привязки к конкретному лицу).
              1.2 Администрации доступна информация, получаемая следующими
              способами: информация, полученная при переписке Администрации с
              Пользователями сайта посредством электронной почты; информация,
              предоставляемая Пользователями при регистрации на сайте /
              заключении Агентского договора, в рамках мероприятий, проводимых
              Администрацией сайта, опросах, заявках, формах обратной связи,
              путём внесения записей в регистрационные онлайн-формы; техническая
              информация — данные об интернет-провайдере Пользователя, IP-адресе
              Пользователя, характеристиках используемого ПК и программного
              обеспечения, данные о загруженных и выгруженных на сайт файлах и
              т.п.; статистические данные о предпочтениях отдельно взятого
              Пользователя (тематика просмотренных страниц). 1.3
              Конфиденциальной, согласно настоящему Соглашению, может быть
              признана лишь информация, хранящаяся в базе данных сайта в
              зашифрованном виде и доступная для просмотра исключительно
              Администрации сайта. 1.4 Информация о лице, добровольно
              размещённая им в общих разделах сайта при заполнении
              регистрационных форм и доступная любому другому пользователю
              сайта, или информация, которая может быть свободно получена из
              других общедоступных источников, не является конфиденциальной.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              2 БЕЗОПАСНОСТЬ
            </h3>
            <p className="font-normal text-black">
              2.1 Администрация сайта использует современные технологии
              обеспечения конфиденциальности персональных данных, данных,
              полученных из регистрационных форм, оставляемых Пользователями
              сайта, с целью обеспечения максимальной защиты информации. 2.2
              Доступ к личной информации Пользователя осуществляется через
              систему авторизации с логином и паролем. Пользователь обязуется
              самостоятельно обеспечить сохранность авторотационных данных и ни
              под каким предлогом не разглашать их третьим лицам. Любые
              изменения личной информации, внесённые посредством авторотационных
              данных, будут считаться осуществлёнными лично Пользователем. 2.3
              Сбор, хранение, использование, обработка, разглашение информации,
              полученной Администрацией сайта в результате посещения
              пользователем сайта и/или заполнения регистрационных форм, в том
              числе и персональные данные пользователей, осуществляется
              администрацией сайта в соответствии с законодательством РФ. 2.4
              Пользователь осознает и предоставляет согласие на сбор и обработку
              своих персональных данных Администрацией сайта в рамках и с целью,
              предусмотренными условиями Агентского договора; обязуется
              уведомлять Администрацию сайта об изменениях его персональных
              данных.
            </p>
          </div>

          <div>
            <h3 className="font-bold text-[16px] leading-[120%] text-[#212529]">
              3 ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
            </h3>
            <p className="font-normal text-black">
              3.1 Принципал, заинтересованный в услугах Агента, заполняет
              специальную форму на сайте. При оформлении заказа Принципал
              указывает UID, ID, Server ID, Zone ID, E-mail учётной записи игры,
              на которую приобретается Цифровая Услуга, а также количество
              требуемой игровой валюты или требуемые игровые предметы. 3.2
              Деятельность Администрации сайта осуществляется в соответствии с
              законодательством РФ. Любые претензии, споры, официальные
              обращения будут рассматриваться исключительно в порядке,
              предусмотренном законодательством РФ. 3.3 Администрация сайта не
              несёт ответственности за любые прямые или косвенные убытки,
              понесённые Пользователями или третьими сторонами, а также за
              упущенную выгоду при использовании, невозможности использования
              или результатов использования сайта. 3.4 условия настоящего
              Соглашения могут быть изменены Администрацией сайта в
              одностороннем порядке
            </p>
          </div>

          <p className="mt-6">
            Мы являемся авторизованным продавцом алмазов Bigo Live. Bigo Live и
            данный веб-сайт управляются отдельными независимыми компаниями и не
            несут ответственности за бизнес друг друга. Bigo Live и данный
            веб-сайт управляются отдельными независимыми компаниями и не несут
            ответственности за услуги друг друга.
          </p>
        </div>
      </div>
    </>
  );
};

export default Confidentiality;
